In [1]:
#Libraries 
import sqlite3
import pandas as pd

#connection with db
conn = sqlite3.connect("ladder.db")

In [2]:
# 32) How many rows are in the `pets` table?

sql= '''SELECT count(*) 
        FROM pets;'''
pd.read_sql(sql,conn)

   count(*)
0        13

In [11]:
#34) How many female cats are in the `pets` table?

sql='''SELECT count(*) 
        FROM pets 
        WHERE sex = 'F' AND species='cat';'''
pd.read_sql(sql,conn)

   count(*)
0         4

In [14]:
#35) What's the mean age of pets in the `pets` table?

sql = '''SELECT AVG(age) 
        FROM pets;'''
pd.read_sql(sql,conn)

   AVG(age)
0  5.230769

In [18]:
#36) What's the mean age of dogs in the `pets` table?

sql='''SELECT AVG(age) 
        FROM pets 
        WHERE species = 'dog';'''

pd.read_sql(sql,conn)

   AVG(age)
0       6.5

In [22]:
# 37) What's the mean age of male dogs in the `pets` table?

sql= '''SELECT AVG(age) 
        FROM pets 
        WHERE sex='M' AND species = 'dog';'''

pd.read_sql(sql,conn)

   AVG(age)
0  8.333333

In [23]:
# 38) What's the count, mean, minimum, and maximum of pet ages in the `pets` table?

sql = '''SELECT COUNT(age), AVG(age), MIN(age), MAX(age) 
        FROM pets;'''

pd.read_sql(sql,conn)

   COUNT(age)  AVG(age)  MIN(age)  MAX(age)
0          13  5.230769         1        10

In [34]:
# 39) Repeat the previous problem with the following stipulations:
    #* Round the average to one decimal place.
    #* Give each column a human-readable column name (for example, "Average Age")
    
sql = '''SELECT COUNT(age) as Number_Rows, ROUND(AVG(age)) as Average_Age,MIN(age) as Minimum_Age,MAX(age) as Maximun_Age
        FROM pets;'''

pd.read_sql(sql,conn)

   Number_Rows  Average_Age  Minimum_Age  Maximun_Age
0           13          5.0            1           10

In [50]:
# 40) How many rows in `employees_null` have missing salaries?

sql = '''SELECT COUNT(*) 
        FROM employees_null
        WHERE salary is null;'''

pd.read_sql(sql,conn)

   COUNT(*)
0        10

In [57]:
# 41) How many salespeople in `employees_null` having _nonmissing_ salaries?

sql = '''SELECT COUNT(job) 
        FROM employees_null
        WHERE job= 'Sales' AND salary is null;'''

pd.read_sql(sql,conn)

   COUNT(job)
0           8

In [62]:
# 42) What's the mean salary of employees who joined the company after 2010? Go back to the usual `employees` table for this one.
#     * _Hint:_ You may need to use the `CAST()` function for this. To cast a string as a float, you can do `CAST(x AS REAL)`

sql=''' SELECT CAST(AVG(salary) AS REAL) 
        FROM employees
        WHERE startdate > 2010;'''

pd.read_sql(sql,conn)

   CAST(AVG(salary) AS REAL)
0                    79814.6

In [65]:
# 43) What's the mean salary of employees in Swiss Francs?
#     * _Hint:_ Swiss Francs are abbreviated "CHF" and 1 USD = 0.97 CHF.

sql ='''SELECT avg(salary_CHF) as average_salry_CHF
        FROM( select *,(salary*0.97)as salary_CHF FROM employees)as a'''
pd.read_sql(sql,conn)

   average_salry_CHF
0         75727.5605

In [68]:
sql ='''SELECT avg(salary*0.97) from employees;'''
pd.read_sql(sql,conn)

   avg(salary*0.97)
0        75727.5605

    ID    firstname  lastname            job  salary   startdate
0    0    Christine  Thompson          Sales  123696  2005-01-20
1    1       Thomas      Peck          Sales  112972  2011-01-04
2    2  Christopher    Robles             IT   78426  2003-12-10
3    3    Elizabeth     Munoz          Sales   55824  1993-07-28
4    4       Janice    Martin             IT   62007  2011-02-25
..  ..          ...       ...            ...     ...         ...
95  95         Tina     Flynn     Operations   55916  2006-01-19
96  96        Allen     Cross          Sales  118571  2019-05-10
97  97     Brittany   Maynard          Sales   69257  2003-02-03
98  98      Bradley    Romero  Administrator   45264  2009-05-10
99  99        Jacob    Baxter          Sales   74536  2012-10-24

[100 rows x 6 columns]

In [98]:
# 44) Create a query that computes the mean salary in USD as well as CHF. Give the columns human-readable names (for example "Mean Salary in USD"). Also, format them with comma delimiters and currency symbols.
#     * _NOTE:_ Comma-delimiting numbers is only available for integers in SQLite, so rounding (down) to the nearest dollar or franc will be done for us.
#     * _NOTE2:_ The symbols for francs is simply `Fr.` or `fr.`. So an example output will look like `100,000 Fr.`.
sql= '''SELECT printf('$%,.2d',AVG(salary))as Mean_Salary_USD,printf('%,.2d%s',AVG(salary*0.97),' Fr.') as Mean_salary_CHF 
        FROM employees;'''

pd.read_sql(sql,conn)

  Mean_Salary_USD Mean_salary_CHF
0         $78,069      75,727 Fr.

In [101]:
# 45) What is the average age of `pets` by species?

sql= '''SELECT species, AVG(age) 
        FROM pets
        GROUP BY species;'''
pd.read_sql(sql,conn)

   species  AVG(age)
0      cat  4.333333
1      dog  6.500000
2  lobster  3.000000

In [102]:
# 46) Repeat the previous problem but make sure the species label is also displayed! Assume this behavior is always being asked of you any time you use `GROUP BY`.

sql= '''SELECT species, AVG(age) 
        FROM pets
        GROUP BY species;'''
pd.read_sql(sql,conn)

   species  AVG(age)
0      cat  4.333333
1      dog  6.500000
2  lobster  3.000000

In [103]:
# 47) What is the count, mean, minimum, and maximum age by species in `pets`?

sql= '''SELECT species, COUNT(age), AVG(age), MIN(age), MAX(age) 
        FROM pets
        GROUP BY species;'''
pd.read_sql(sql,conn)

   species  COUNT(age)  AVG(age)  MIN(age)  MAX(age)
0      cat           6  4.333333         2         7
1      dog           6  6.500000         1        10
2  lobster           1  3.000000         3         3

In [104]:
# 48) Show the mean salaries of each job title in `employees`.

sql= '''SELECT job, AVG(salary)
        FROM employees
        GROUP BY job;'''
pd.read_sql(sql,conn)

             job   AVG(salary)
0  Administrator  71986.142857
1             IT  71381.000000
2     Operations  74055.250000
3          Sales  80778.044118

In [106]:
# 49) Show the mean salaries in New Zealand dollars of each job title in `employees`.
#     * _NOTE:_ 1 USD = 1.65 NZD.

sql= '''SELECT job, printf('%,.2d%s',AVG(salary*1.67), ' NZD.') AS Mean_Salary_New_Zealand 
        FROM employees
        GROUP BY job;'''
pd.read_sql(sql,conn)

             job Mean_Salary_New_Zealand
0  Administrator            120,216 NZD.
1             IT            119,206 NZD.
2     Operations            123,672 NZD.
3          Sales            134,899 NZD.

In [107]:
# 50) Show the mean, min, and max salaries of each job title in `employees`, as well as the numbers of employees in each category.

sql= '''SELECT job, AVG(salary), MIN(salary), MAX(salary), COUNT(job) 
        FROM employees
        GROUP BY job;'''
pd.read_sql(sql,conn)

             job   AVG(salary)  MIN(salary)  MAX(salary)  COUNT(job)
0  Administrator  71986.142857        41151       120492          14
1             IT  71381.000000        37397       115729          10
2     Operations  74055.250000        41797       108989           8
3          Sales  80778.044118        31333       124474          68

In [108]:
# 51) Show the mean salaries of each job title in `employees` sorted descending by salary.

sql= '''SELECT job, AVG(salary) 
        FROM employees
        GROUP BY job
        ORDER BY salary DESC;'''
pd.read_sql(sql,conn)

             job   AVG(salary)
0          Sales  80778.044118
1             IT  71381.000000
2     Operations  74055.250000
3  Administrator  71986.142857

In [122]:
# 52) What are the top 5 most common first names among `employees`?

sql= '''SELECT firstname, count(firstname)
        FROM employees
        GROUP BY firstname
        ORDER BY count(firstname) DESC
        LIMIT 5;'''
pd.read_sql(sql,conn)

  firstname  count(firstname)
0    Thomas                 3
1    Robert                 3
2   Michael                 3
3      Lisa                 3
4   William                 2

In [123]:
# 53) Show all first names which have exactly 2 occurrences in `employees`.

sql= '''SELECT firstname, COUNT(firstname) 
        FROM employees
        GROUP BY firstname
        HAVING COUNT(firstname)=2;'''
pd.read_sql(sql,conn)

     firstname  COUNT(firstname)
0  Christopher                 2
1       Donald                 2
2    Elizabeth                 2
3        Jacob                 2
4       Joseph                 2
5       Leslie                 2
6         Mark                 2
7      Shannon                 2
8      William                 2

In [125]:
# 54) Take a look at the `transactions` table to get a idea of what it contains. Note that a transaction may span multiple rows if different items are purchased as part of the same order. The employee who made the order is also given by their ID.

sql= '''SELECT * 
        FROM transactions;'''
pd.read_sql(sql,conn)

,order_id,customer,unit_price,quantity,orderdate,employee_id
0,0,Bautista Group,20.50,12,2018-10-27,81
1,0,Bautista Group,24.00,11,2018-10-27,81
2,0,Bautista Group,22.25,14,2018-10-27,81
3,0,Bautista Group,10.50,11,2018-10-27,81
4,0,Bautista Group,13.75,9,2018-10-27,81
...,...,...,...,...,...,...
50076,9999,"Taylor, Patel and Harvey",10.00,11,2003-06-17,46
50077,9999,"Taylor, Patel and Harvey",17.75,11,2003-06-17,46
50078,9999,"Taylor, Patel and Harvey",22.75,10,2003-06-17,46
50079,9999,"Taylor, Patel and Harvey",14.00,7,2003-06-17,46
50080,9999,"Taylor, Patel and Harvey",16.25,8,2003-06-17,46

In [136]:
# 55) Show the top 5 largest orders (and their respective customer) in terms of the numbers of items purchased in that order.

sql= '''SELECT customer, count(order_id),SUM(quantity)
        FROM transactions
        GROUP BY order_id
        ORDER BY count(order_id) DESC
        LIMIT 5;'''
pd.read_sql(sql,conn)

                       customer  count(order_id)  SUM(quantity)
0      Taylor, Patel and Harvey               15            149
1                Watson-Sanders               15            163
2  Hernandez, Rhodes and Curtis               14            140
3                Bautista Group               14            139
4      Martin, Parker and Jones               14            136

In [137]:
# 56) Show the total cost of each transaction.
#     * _Hint:_ The `unit_price` column is the price of _one_ item. The customer may have purchased multiple.
#     * _Hint2:_ Note that transactions here span multiple rows if different items are purchased.
sql= '''SELECT  order_id, customer,SUM(unit_price)
        FROM transactions
        GROUP BY order_id
        ;'''
pd.read_sql(sql,conn)

      order_id                  customer  SUM(unit_price)
0            0            Bautista Group           109.00
1            1                Pineda PLC           102.75
2            2              Smith-Thomas            42.50
3            3     Norton, Lin and Kelly             9.25
4            4             Bennett-Brown           120.00
...        ...                       ...              ...
9924      9995            Patterson-Vega            67.50
9925      9996            Patterson-Vega            51.75
9926      9997               Pittman PLC            66.75
9927      9998         Velasquez-Alvarez            94.00
9928      9999  Taylor, Patel and Harvey           129.50

[9929 rows x 3 columns]

In [141]:
# 57) Show the top 5 transactions in terms of total cost.

sql= '''SELECT  order_id, customer,SUM(unit_price)
        FROM transactions
        GROUP BY order_id
        ORDER BY SUM(unit_price) DESC
        LIMIT 5;'''
pd.read_sql(sql,conn)

   order_id                        customer  SUM(unit_price)
0      6324        Taylor, Patel and Harvey           234.50
1      2435                        Hill Ltd           221.50
2      6338  Castaneda, Nguyen and Erickson           214.75
3      2190       Griffin, Jones and Foster           213.75
4       612     Little, Chang and Hernandez           213.75

In [145]:
# 58) Show the top 5 customers in terms of total revenue (ie, which customers have we done the most business with in terms of money?)

sql= '''SELECT  customer,(SUM(unit_price)*SUM(quantity)) AS revenue
        FROM transactions
        GROUP BY customer
        ORDER BY SUM(unit_price) DESC
        LIMIT 5;'''
pd.read_sql(sql,conn)

                   customer      revenue
0              Kelly-Wright  56617683.75
1                Tucker Ltd  53876156.50
2               Sanders PLC  50397800.50
3               Ewing-Black  50459289.00
4  Taylor, Patel and Harvey  49479072.75

In [ ]:
# 59) Show the top 5 employees in terms of revenue generated (ie, which employees made the most in sales?)

In [ ]:
# 60) Which customer worked with the largest number of employees?
#     * _Hint:_ This is a tough one! Check out the `DISTINCT` keyword.

In [ ]:
# 61) Show all customers who've done more than $80,000 worth of business with us.

In [142]:
sql= '''SELECT * 
        FROM transactions;'''
pd.read_sql(sql,conn)

,order_id,customer,unit_price,quantity,orderdate,employee_id
0,0,Bautista Group,20.50,12,2018-10-27,81
1,0,Bautista Group,24.00,11,2018-10-27,81
2,0,Bautista Group,22.25,14,2018-10-27,81
3,0,Bautista Group,10.50,11,2018-10-27,81
4,0,Bautista Group,13.75,9,2018-10-27,81
...,...,...,...,...,...,...
50076,9999,"Taylor, Patel and Harvey",10.00,11,2003-06-17,46
50077,9999,"Taylor, Patel and Harvey",17.75,11,2003-06-17,46
50078,9999,"Taylor, Patel and Harvey",22.75,10,2003-06-17,46
50079,9999,"Taylor, Patel and Harvey",14.00,7,2003-06-17,46
50080,9999,"Taylor, Patel and Harvey",16.25,8,2003-06-17,46